export function createAsciiBannerPlugin(packageJson) {
	return {
		name: 'ascii-banner',
		configureServer() {
			printBanner(packageJson, 'Powered by Moonkake')
		},
		closeBundle() {
			printBanner(packageJson, 'Powered by Moonkake')
		},
	}
}

function printBanner(packageJson, text = '') {
	console.log(`
\x1b[36m  ███╗   ███╗ ██████╗  ██████╗ ███╗   ██╗██╗  ██╗ █████╗ ██╗  ██╗███████╗
  ████╗ ████║██╔═══██╗██╔═══██╗████╗  ██║██║ ██╔╝██╔══██╗██║ ██╔╝██╔════╝
  ██╔████╔██║██║   ██║██║   ██║██╔██╗ ██║█████╔╝ ███████║█████╔╝ █████╗
  ██║╚██╔╝██║██║   ██║██║   ██║██║╚██╗██║██╔═██╗ ██╔══██║██╔═██╗ ██╔══╝
  ██║ ╚═╝ ██║╚██████╔╝╚██████╔╝██║ ╚████║██║  ██╗██║  ██║██║  ██╗███████╗
  ╚═╝     ╚═╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝╚═╝  ╚═╝╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝\x1b[0m
\x1b[90m  ${text} v${packageJson.version}\x1b[0m
`)
}
